## Pandas

#### Pandas is a Python library for data analysis. It offers a number of data exploration, cleaning and transformation operations that are critical in working with data in Python.

## Series

In [98]:
import pandas as pd

In [99]:
grociries = pd.Series(data=[30, 9, 'Yes', 'No'], index=[
                      'eggs', 'apples', 'milk', 'bread'])
print(grociries)

eggs       30
apples      9
milk      Yes
bread      No
dtype: object

In [100]:
grociries.shape

(4,)

In [101]:
grociries.ndim

1

In [102]:
grociries.size

4

In [103]:
grociries.index

Index(['eggs', 'apples', 'milk', 'bread'], dtype='object')

In [104]:
grociries.values

array([30, 9, 'Yes', 'No'], dtype=object)

In [105]:
'banana' in grociries

False

In [106]:
'bread' in grociries

True

## Accessing and Deleting Elements in Pandas Series

In [107]:
grociries['eggs']

30

In [108]:
grociries[['milk', 'bread']]

milk     Yes
bread     No
dtype: object

In [109]:
grociries[0]

30

In [110]:
grociries[-1]

'No'

In [111]:
grociries[[0, 1]]

eggs      30
apples     9
dtype: object

In [112]:
grociries.loc[['eggs', 'apples']]

eggs      30
apples     9
dtype: object

In [113]:
grociries.iloc[[0, 1]]

eggs      30
apples     9
dtype: object

In [114]:
grociries

eggs       30
apples      9
milk      Yes
bread      No
dtype: object

In [115]:
grociries['eggs'] = 2
grociries

eggs        2
apples      9
milk      Yes
bread      No
dtype: object

In [116]:
grociries.drop('apples')

eggs       2
milk     Yes
bread     No
dtype: object

In [117]:
grociries

eggs        2
apples      9
milk      Yes
bread      No
dtype: object

In [118]:
grociries.drop('apples', inplace=True)

In [119]:
grociries

eggs       2
milk     Yes
bread     No
dtype: object

## Arithmetic Operations on Pandas Series

In [120]:
fruits = pd.Series(data = [10, 6, 3,], index = ['apples', 'oranges', 'bananas'])

In [121]:
fruits

apples     10
oranges     6
bananas     3
dtype: int64

In [122]:
fruits + 2

apples     12
oranges     8
bananas     5
dtype: int64

In [123]:
fruits - 2

apples     8
oranges    4
bananas    1
dtype: int64

In [124]:
fruits * 2

apples     20
oranges    12
bananas     6
dtype: int64

In [125]:
fruits / 2

apples     5.0
oranges    3.0
bananas    1.5
dtype: float64

In [126]:
import numpy as np

In [127]:
fruits

apples     10
oranges     6
bananas     3
dtype: int64

In [128]:
np.sqrt(fruits)

apples     3.162278
oranges    2.449490
bananas    1.732051
dtype: float64

In [129]:
np.exp(fruits)

apples     22026.465795
oranges      403.428793
bananas       20.085537
dtype: float64

In [130]:
np.power(fruits, 2)

apples     100
oranges     36
bananas      9
dtype: int64

In [131]:
fruits['bananas'] + 2

5

In [132]:
fruits['apples'] - 2

8

In [133]:
fruits.iloc[0] - 2

8

In [134]:
fruits[['apples', 'oranges']] * 2

apples     20
oranges    12
dtype: int64

In [135]:
fruits.loc[['apples', 'oranges']] / 2

apples     5.0
oranges    3.0
dtype: float64

In [136]:
grociries = pd.Series(data=[30, 9, 'Yes', 'No'], index=['eggs', 'apples', 'milk', 'bread'])

In [137]:
grociries * 2

eggs          60
apples        18
milk      YesYes
bread       NoNo
dtype: object

## DataFrame

In [138]:
items = {'Bob': pd.Series(data=[245, 25, 55], index=['bike', 'pants', 'watch']),
         'Alice': pd.Series(data=[40, 110, 500, 45], index=['book', 'glasses', 'bike', 'pants'])}
type(items)

dict

In [139]:
shopping_carts = pd.DataFrame(items)
shopping_carts

           Bob  Alice
bike     245.0  500.0
book       NaN   40.0
glasses    NaN  110.0
pants     25.0   45.0
watch     55.0    NaN

In [140]:
data = {'Bob': pd.Series(data=[245, 25, 55]),
        'Alice': pd.Series(data=[40, 110, 500, 45])}
df = pd.DataFrame(data)
df

     Bob  Alice
0  245.0     40
1   25.0    110
2   55.0    500
3    NaN     45

In [141]:
shopping_carts.columns

Index(['Bob', 'Alice'], dtype='object')

In [142]:
shopping_carts.index

Index(['bike', 'book', 'glasses', 'pants', 'watch'], dtype='object')

In [143]:
shopping_carts.values

array([[245., 500.],
       [ nan,  40.],
       [ nan, 110.],
       [ 25.,  45.],
       [ 55.,  nan]])

In [144]:
shopping_carts.shape

(5, 2)

In [145]:
shopping_carts.ndim

2

In [146]:
shopping_carts.size

10

In [147]:
bob_shopping_cart = pd.DataFrame(items, columns=['Bob'])
bob_shopping_cart

       Bob
bike   245
pants   25
watch   55

In [148]:
sel_shopping_cart = pd.DataFrame(items, index=['pants', 'book'])
sel_shopping_cart

        Bob  Alice
pants  25.0     45
book    NaN     40

In [149]:
alice_sel_shopping_cart = pd.DataFrame(items, index=['glasses', 'bike'], columns=['Alice'])
alice_sel_shopping_cart

         Alice
glasses    110
bike       500

In [150]:
data = {'Integers': [1, 2, 3],
        'Floats': [4.5, 8.2, 9.6]}
df = pd.DataFrame(data, index=['label 1', 'label 2', 'label 3'])
df

         Integers  Floats
label 1         1     4.5
label 2         2     8.2
label 3         3     9.6

In [151]:
items = [{'bikes': 20, 'pants': 30, 'watches': 35},
            {'watches': 10, 'glasses': 50, 'bikes': 15, 'pants': 5}]

store_items = pd.DataFrame(items, index=['store 1', 'store 2'])
store_items

         bikes  pants  watches  glasses
store 1     20     30       35      NaN
store 2     15      5       10     50.0

## Accessing elements in Pandas DataFrames

In [152]:
store_items[['bikes']]

         bikes
store 1     20
store 2     15

In [153]:
store_items[['bikes', 'pants']]

         bikes  pants
store 1     20     30
store 2     15      5

In [154]:
store_items.loc[['store 1']]

         bikes  pants  watches  glasses
store 1     20     30       35      NaN

In [155]:
store_items['bikes']['store 2']

15

In [156]:
store_items['shirts'] = [15, 2]
store_items

         bikes  pants  watches  glasses  shirts
store 1     20     30       35      NaN      15
store 2     15      5       10     50.0       2

In [157]:
store_items['suits'] = store_items['pants'] + store_items['shirts']
store_items

         bikes  pants  watches  glasses  shirts  suits
store 1     20     30       35      NaN      15     45
store 2     15      5       10     50.0       2      7

In [158]:
new_items = [{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4}]
new_store = pd.DataFrame(new_items, index=['store 3'])
new_store

         bikes  pants  watches  glasses
store 3     20     30       35        4

In [159]:
store_items = pd.concat([store_items, new_store], sort=False)
store_items

         bikes  pants  watches  glasses  shirts  suits
store 1     20     30       35      NaN    15.0   45.0
store 2     15      5       10     50.0     2.0    7.0
store 3     20     30       35      4.0     NaN    NaN

In [160]:
store_items['new_watches'] = store_items['watches'][1:]
store_items

         bikes  pants  watches  glasses  shirts  suits  new_watches
store 1     20     30       35      NaN    15.0   45.0          NaN
store 2     15      5       10     50.0     2.0    7.0         10.0
store 3     20     30       35      4.0     NaN    NaN         35.0

In [161]:
store_items.insert(5, 'shoes', [8, 5, 0])
store_items

         bikes  pants  watches  glasses  shirts  shoes  suits  new_watches
store 1     20     30       35      NaN    15.0      8   45.0          NaN
store 2     15      5       10     50.0     2.0      5    7.0         10.0
store 3     20     30       35      4.0     NaN      0    NaN         35.0

In [162]:
store_items.pop('new_watches')
store_items

         bikes  pants  watches  glasses  shirts  shoes  suits
store 1     20     30       35      NaN    15.0      8   45.0
store 2     15      5       10     50.0     2.0      5    7.0
store 3     20     30       35      4.0     NaN      0    NaN

In [163]:
store_items = store_items.drop(['watches', 'shoes'], axis=1)
store_items

         bikes  pants  glasses  shirts  suits
store 1     20     30      NaN    15.0   45.0
store 2     15      5     50.0     2.0    7.0
store 3     20     30      4.0     NaN    NaN

In [164]:
store_items = store_items.drop(['store 1', 'store 2'], axis=0)
store_items

         bikes  pants  glasses  shirts  suits
store 3     20     30      4.0     NaN    NaN

In [166]:
store_items = store_items.rename(columns={'bikes': 'hats'})
store_items

         hats  pants  glasses  shirts  suits
store 3    20     30      4.0     NaN    NaN

In [167]:
store_items = store_items.rename(index={'store 3': 'last store'})
store_items

            hats  pants  glasses  shirts  suits
last store    20     30      4.0     NaN    NaN

In [168]:
store_items = store_items.set_index('pants')
store_items

       hats  glasses  shirts  suits
pants
30       20      4.0     NaN    NaN